# PANDAS BASICS

In [1]:
import pandas as pd

<ipython-input-1-7dd3504c366f>:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
df = pd.read_csv("testfile2.csv")

In [3]:
df.head()

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
0,1,Bubbletube,8893,542 Dayton Center,Dodge,Ram 2500,Goldenrod,2007,521963.45,60760-224,Louie Hinsche,Male,744796.41,1
1,2,Tagopia,9444,0674 Springview Circle,Toyota,Tundra,Crimson,2010,672222.04,67457-594,Alexandros Manuel,Male,794773.17,1
2,3,Zoomdog,253,70 Autumn Leaf Center,GMC,Savana 1500,Crimson,2011,504465.72,58411-135,Alvie Weighell,Male,968244.90,1
3,4,Oozz,1283,649 Corben Lane,Volkswagen,Cabriolet,Fuscia,1990,646077.11,0591-5307,Flint Gunston,Male,942213.82,2
4,5,Kare,8905,94 Namekagon Point,Mercury,Mariner,Teal,2009,699890.24,51655-189,Alyssa Filpi,Female,879519.57,1

In [4]:
df.describe()

,SupplierID,ProductID,CarModelYear,CarPrice,Sales,Quantity
count,299.000000,299.000000,299.000000,299.000000,299.000000,299.000000
mean,150.000000,5255.949833,2001.558528,653593.511940,853155.083712,1.545151
std,86.458082,3144.964873,8.040110,86827.623148,87189.938999,0.498792
min,1.000000,24.000000,1970.000000,500952.880000,700321.490000,1.000000
25%,75.500000,2525.000000,1996.000000,575139.960000,768007.550000,1.000000
50%,150.000000,5419.000000,2003.000000,662587.930000,858307.070000,2.000000
75%,224.500000,8123.000000,2008.500000,724029.310000,931347.470000,2.000000
max,299.000000,9959.000000,2013.000000,799454.240000,998843.290000,2.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 299 entries, 0 to 298
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   SupplierID       299 non-null    int64
 1   SupplierName     299 non-null    object
 2   ProductID        299 non-null    int64
 3   SupplierAddress  299 non-null    object
 4   CarMaker         299 non-null    object
 5   CarModel         299 non-null    object
 6   CarColor         299 non-null    object
 7   CarModelYear     299 non-null    int64
 8   CarPrice         299 non-null    float64
 9   CustomerID       299 non-null    object
 10  CustomerName     299 non-null    object
 11  Gender           299 non-null    object
 12  Sales            299 non-null    float64
 13  Quantity         299 non-null    int64
dtypes: float64(2), int64(4), object(8)
memory usage: 23.4+ KB

In [6]:
df.dtypes

SupplierID           int64
SupplierName        object
ProductID            int64
SupplierAddress     object
CarMaker            object
CarModel            object
CarColor            object
CarModelYear         int64
CarPrice           float64
CustomerID          object
CustomerName        object
Gender              object
Sales              float64
Quantity             int64
dtype: object

In [7]:
df['CarModel'].dtype

dtype('O')

In [8]:
df.columns

Index(['SupplierID', 'SupplierName', 'ProductID', 'SupplierAddress',
       'CarMaker', 'CarModel', 'CarColor', 'CarModelYear', 'CarPrice',
       'CustomerID', 'CustomerName', 'Gender', 'Sales', 'Quantity'],
      dtype='object')

In [9]:
df.axes

[RangeIndex(start=0, stop=299, step=1),
 Index(['SupplierID', 'SupplierName', 'ProductID', 'SupplierAddress',
        'CarMaker', 'CarModel', 'CarColor', 'CarModelYear', 'CarPrice',
        'CustomerID', 'CustomerName', 'Gender', 'Sales', 'Quantity'],
       dtype='object')]

In [10]:
df.ndim

2

In [11]:
df.size

4186

In [12]:
df.shape

(299, 14)

In [13]:
df.values

array([[1, 'Bubbletube', 8893, ..., 'Male', 744796.41, 1],
       [2, 'Tagopia', 9444, ..., 'Male', 794773.17, 1],
       [3, 'Zoomdog', 253, ..., 'Male', 968244.9, 1],
       ...,
       [297, 'Ntag', 9542, ..., 'Female', 730755.76, 1],
       [298, 'Demizz', 8052, ..., 'Female', 735854.69, 1],
       [299, 'JumpXS', 8765, ..., 'Female', 908766.53, 2]], dtype=object)

In [14]:
len(df)

299

In [15]:
df.size

4186

In [17]:
df.columns

Index(['SupplierID', 'SupplierName', 'ProductID', 'SupplierAddress',
       'CarMaker', 'CarModel', 'CarColor', 'CarModelYear', 'CarPrice',
       'CustomerID', 'CustomerName', 'Gender', 'Sales', 'Quantity'],
      dtype='object')

In [18]:
df.dtypes

SupplierID           int64
SupplierName        object
ProductID            int64
SupplierAddress     object
CarMaker            object
CarModel            object
CarColor            object
CarModelYear         int64
CarPrice           float64
CustomerID          object
CustomerName        object
Gender              object
Sales              float64
Quantity             int64
dtype: object

In [19]:
df.min()

SupplierID                         1
SupplierName                   Abata
ProductID                         24
SupplierAddress      0 Almo Crossing
CarMaker                       Acura
CarModel                      09-May
CarColor                  Aquamarine
CarModelYear                    1970
CarPrice                   500952.88
CustomerID                 0006-0951
CustomerName       Abigael Smalridge
Gender                        Female
Sales                      700321.49
Quantity                           1
dtype: object

In [20]:
df.max()

SupplierID                       299
SupplierName                  Zoozzy
ProductID                       9959
SupplierAddress    9973 Fuller Alley
CarMaker                       Volvo
CarModel               Yukon XL 2500
CarColor                      Yellow
CarModelYear                    2013
CarPrice                   799454.24
CustomerID                76519-1017
CustomerName             Zora Kobpac
Gender                          Male
Sales                      998843.29
Quantity                           2
dtype: object

In [28]:
df[['SupplierID','ProductID','CarModelYear','CarPrice','Sales','Quantity']].mean()

SupplierID         150.000000
ProductID         5255.949833
CarModelYear      2001.558528
CarPrice        653593.511940
Sales           853155.083712
Quantity             1.545151
dtype: float64

In [31]:
df[['SupplierID','ProductID','CarModelYear','CarPrice','Sales','Quantity']].median()

SupplierID         150.00
ProductID         5419.00
CarModelYear      2003.00
CarPrice        662587.93
Sales           858307.07
Quantity             2.00
dtype: float64

In [32]:
df[['SupplierID','ProductID','CarModelYear','CarPrice','Sales','Quantity']].std()

SupplierID         86.458082
ProductID        3144.964873
CarModelYear        8.040110
CarPrice        86827.623148
Sales           87189.938999
Quantity            0.498792
dtype: float64

In [33]:
df[['SupplierID','ProductID','CarModelYear','CarPrice','Sales','Quantity']].var()

SupplierID      7.475000e+03
ProductID       9.890804e+06
CarModelYear    6.464338e+01
CarPrice        7.539036e+09
Sales           7.602085e+09
Quantity        2.487935e-01
dtype: float64

In [34]:
df[['SupplierID','ProductID','CarModelYear','CarPrice','Sales','Quantity']].sum()

SupplierID      4.485000e+04
ProductID       1.571529e+06
CarModelYear    5.984660e+05
CarPrice        1.954245e+08
Sales           2.550934e+08
Quantity        4.620000e+02
dtype: float64

In [35]:
df[['SupplierID','ProductID','CarModelYear','CarPrice','Sales','Quantity']].quantile(0.25)

SupplierID          75.50
ProductID         2525.00
CarModelYear      1996.00
CarPrice        575139.96
Sales           768007.55
Quantity             1.00
Name: 0.25, dtype: float64

In [36]:
df[['SupplierID','ProductID','CarModelYear','CarPrice','Sales','Quantity']].quantile(0.50)

SupplierID         150.00
ProductID         5419.00
CarModelYear      2003.00
CarPrice        662587.93
Sales           858307.07
Quantity             2.00
Name: 0.5, dtype: float64

In [37]:
df.sum()              #sum gives sum of all columns respectively not only int

SupplierID                                                     44850
SupplierName       BubbletubeTagopiaZoomdogOozzKareRhynyxRoomboWo...
ProductID                                                    1571529
SupplierAddress    542 Dayton Center0674 Springview Circle70 Autu...
CarMaker           DodgeToyotaGMCVolkswagenMercuryToyotaSubaruBMW...
CarModel           Ram 2500TundraSavana 1500CabrioletMarinerLand ...
CarColor           GoldenrodCrimsonCrimsonFusciaTealCrimsonIndigo...
CarModelYear                                                  598466
CarPrice                                                195424460.07
CustomerID         60760-22467457-59458411-1350591-530751655-1896...
CustomerName       Louie HinscheAlexandros ManuelAlvie WeighellFl...
Gender             MaleMaleMaleMaleFemaleMaleMaleFemaleFemaleMale...
Sales                                                   255093370.03
Quantity                                                         462
dtype: object

In [40]:
df.sample(10)

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
206,207,Voonte,7841,5 Dapin Way,Plymouth,Voyager,Puce,1992,666907.63,51861-010,Tuesday Horsefield,Female,979097.48,1
157,158,Skidoo,9232,54120 5th Lane,Suzuki,Sidekick,Blue,1992,541872.99,0121-0772,Allissa Gwilt,Female,781324.74,1
236,237,Trilith,4050,04740 6th Point,Mitsubishi,Starion,Yellow,1987,755397.16,52642-006,Petra Joliffe,Female,877668.97,2
243,244,Yacero,1422,0 Barby Center,Volvo,V40,Goldenrod,2004,655763.96,52686-274,Victor Ivan,Male,815360.30,1
158,159,Ainyx,2182,48 Michigan Crossing,Mazda,MX-3,Purple,1994,614853.62,66497-0001,Maxim Aizlewood,Male,932723.37,1
126,127,Mycat,1955,9785 Service Drive,GMC,Canyon,Orange,2008,799454.24,60505-3780,Ade Mityashev,Male,781571.38,1
3,4,Oozz,1283,649 Corben Lane,Volkswagen,Cabriolet,Fuscia,1990,646077.11,0591-5307,Flint Gunston,Male,942213.82,2
36,37,Oyonder,5911,0 Almo Crossing,Chevrolet,Corvette,Green,1998,579336.10,0603-1384,Orland Morpeth,Male,883232.92,2
45,46,Omba,2187,6 Artisan Court,Mitsubishi,Endeavor,Orange,2009,604079.51,51523-018,Homere Denford,Male,847068.11,1
222,223,Skipfire,101,5 Hoffman Place,Toyota,Highlander,Yellow,2009,765726.97,49999-598,Richart Lebbon,Male,712970.25,1

In [41]:
df.dropna()

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
0,1,Bubbletube,8893,542 Dayton Center,Dodge,Ram 2500,Goldenrod,2007,521963.45,60760-224,Louie Hinsche,Male,744796.41,1
1,2,Tagopia,9444,0674 Springview Circle,Toyota,Tundra,Crimson,2010,672222.04,67457-594,Alexandros Manuel,Male,794773.17,1
2,3,Zoomdog,253,70 Autumn Leaf Center,GMC,Savana 1500,Crimson,2011,504465.72,58411-135,Alvie Weighell,Male,968244.90,1
3,4,Oozz,1283,649 Corben Lane,Volkswagen,Cabriolet,Fuscia,1990,646077.11,0591-5307,Flint Gunston,Male,942213.82,2
4,5,Kare,8905,94 Namekagon Point,Mercury,Mariner,Teal,2009,699890.24,51655-189,Alyssa Filpi,Female,879519.57,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
294,295,Aivee,4041,13 Hauk Way,Pontiac,Grand Am,Fuscia,1988,511763.96,60429-369,Chandler Hawkett,Male,981485.26,2
295,296,Twitterlist,146,566 Westerfield Point,Lincoln,MKZ,Violet,2007,732421.30,30142-406,Matthieu Bonifant,Male,941955.73,1
296,297,Ntag,9542,4199 Bonner Terrace,Buick,Rainier,Indigo,2005,539855.21,45802-806,Brande Sebright,Female,730755.76,1
297,298,Demizz,8052,0347 Morrow Avenue,Mercedes-Benz,E-Class,Khaki,2007,725040.78,43269-612,Dorena Coatham,Female,735854.69,1
298,299,JumpXS,8765,627 Havey Drive,Volkswagen,Passat,Mauv,2012,714281.60,55154-1855,Elladine Rivaland,Female,908766.53,2

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 299 entries, 0 to 298
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   SupplierID       299 non-null    int64
 1   SupplierName     299 non-null    object
 2   ProductID        299 non-null    int64
 3   SupplierAddress  299 non-null    object
 4   CarMaker         299 non-null    object
 5   CarModel         299 non-null    object
 6   CarColor         299 non-null    object
 7   CarModelYear     299 non-null    int64
 8   CarPrice         299 non-null    float64
 9   CustomerID       299 non-null    object
 10  CustomerName     299 non-null    object
 11  Gender           299 non-null    object
 12  Sales            299 non-null    float64
 13  Quantity         299 non-null    int64
dtypes: float64(2), int64(4), object(8)
memory usage: 23.4+ KB

In [44]:
df[['SupplierID','ProductID','CarModelYear','CarPrice','Sales','Quantity']].iloc[:50,].mean()

SupplierID          25.5000
ProductID         5539.9000
CarModelYear      2002.2000
CarPrice        656656.4526
Sales           855485.1394
Quantity             1.5400
dtype: float64

In [45]:
df[['SupplierID','ProductID','CarModelYear','CarPrice','Sales','Quantity']].head(50).mean()

SupplierID          25.5000
ProductID         5539.9000
CarModelYear      2002.2000
CarPrice        656656.4526
Sales           855485.1394
Quantity             1.5400
dtype: float64

In [49]:
df['CarModel'].count

<bound method Series.count of 0         Ram 2500
1           Tundra
2      Savana 1500
3        Cabriolet
4          Mariner
          ...
294       Grand Am
295            MKZ
296        Rainier
297        E-Class
298         Passat
Name: CarModel, Length: 299, dtype: object>

In [50]:
df['CarModel'].count()

299

In [51]:
df['Sales'].mean()      #Avg

853155.0837123747

In [63]:
df1 = df.groupby(['SupplierName'])
df1                            #if simply write df output pandas series object

In [77]:
df1 = df.groupby(['SupplierName'])
df1.max()                      # give dataframe when statistics applied

,SupplierID,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
SupplierName,,,,,,,,,,,,,
Abata,170,9602,68 Nevada Pass,Morgan,Aero 8,Violet,2007,715190.72,30142-104,Germayne Meryett,Male,929803.73,2
Abatz,235,53,344 Marquette Park,Mazda,MPV,Puce,1992,750536.81,49215-0001,Flory Martugin,Female,833339.07,2
Aibox,151,5523,995 Kim Place,Mitsubishi,GTO,Purple,1999,605573.45,69152-0006,Ermina Brambill,Female,743622.93,2
Ainyx,212,9955,5 Onsgard Way,Mitsubishi,MX-3,Turquoise,2007,797965.14,66497-0001,Maxim Aizlewood,Male,932723.37,2
Aivee,295,4041,13 Hauk Way,Pontiac,Grand Am,Fuscia,1988,511763.96,60429-369,Chandler Hawkett,Male,981485.26,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
Zoomdog,281,8772,70 Autumn Leaf Center,GMC,Savana 1500,Red,2011,771998.97,58411-135,Tiebout Pizzey,Male,968244.90,2
Zoonder,211,8723,90 Chive Junction,GMC,Jimmy,Orange,1999,576531.57,11673-165,Edouard Gulleford,Male,831547.06,2
Zoovu,113,7713,34 Quincy Point,Cadillac,Seville,Khaki,1997,580966.08,36987-2014,Freeman Firbank,Male,895368.03,2
Zooxo,70,7841,2693 Lakewood Pass,Mercedes-Benz,SL-Class,Blue,2000,693279.61,64980-183,Winna Heber,Female,723633.61,2
Zoozzy,110,8155,37 Monument Hill,Land Rover,Range Rover,Crimson,1986,569435.74,65862-599,Paton Clynman,Male,981365.77,1

In [70]:
df.groupby('CarModel')[['SupplierName']].min()

                SupplierName
CarModel
09-May              Photobug
100                    Quinu
1500                   Mynte
2500 Club Coupe        Abata
300               Babbleblab
...                      ...
XK Series              Yozio
XLR                     DabZ
XT                    Avaveo
Yukon XL 1500           Lazz
Yukon XL 2500         Kayveo

[227 rows x 1 columns]

In [72]:
df.groupby('CarModel')['Sales'].mean()              #single bracket gives pandas series

CarModel
09-May             738823.53
100                891387.37
1500               819525.67
2500 Club Coupe    929803.73
300                761905.00
                     ...
XK Series          881577.52
XLR                752558.40
XT                 847308.19
Yukon XL 1500      855212.03
Yukon XL 2500      754756.67
Name: Sales, Length: 227, dtype: float64

In [78]:
df.groupby('CarModel')[['Sales']].mean()            #double bracket gives dataframe

                     Sales
CarModel
09-May           738823.53
100              891387.37
1500             819525.67
2500 Club Coupe  929803.73
300              761905.00
...                    ...
XK Series        881577.52
XLR              752558.40
XT               847308.19
Yukon XL 1500    855212.03
Yukon XL 2500    754756.67

[227 rows x 1 columns]

In [80]:
df.groupby(['CarModel'],sort=False)[['Sales']].mean()                #groupby usually in ascending order

                         Sales
CarModel
Ram 2500         836524.026667
Tundra           842568.073333
Savana 1500      841705.885000
Cabriolet        853338.360000
Mariner          879519.570000
...                        ...
Sunbird          747147.580000
Firefly          933482.060000
3500 Club Coupe  701880.610000
MKZ              941955.730000
Passat           908766.530000

[227 rows x 1 columns]

In [83]:
df1 = df[df['Sales']>900000]
df1

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
2,3,Zoomdog,253,70 Autumn Leaf Center,GMC,Savana 1500,Crimson,2011,504465.72,58411-135,Alvie Weighell,Male,968244.90,1
3,4,Oozz,1283,649 Corben Lane,Volkswagen,Cabriolet,Fuscia,1990,646077.11,0591-5307,Flint Gunston,Male,942213.82,2
5,6,Rhynyx,8877,46347 Dunning Drive,Toyota,Land Cruiser,Crimson,2005,694373.94,65811-0001,Wiatt Piche,Male,947785.40,2
9,10,Feedfire,492,100 Anhalt Place,Subaru,Justy,Crimson,1988,798573.59,54868-5732,Archer Landsborough,Male,902866.47,1
10,11,Layo,9212,7 Esch Trail,Mercedes-Benz,M-Class,Mauv,2002,722114.57,0955-1015,Duff Dodgshun,Male,932957.69,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
288,289,Geba,6072,00085 Anniversary Parkway,BMW,5 Series,Goldenrod,2012,531392.16,55154-5089,Boonie Milkeham,Male,919142.33,1
291,292,Flashspan,5021,850 Gerald Park,Pontiac,Firefly,Aquamarine,1995,719071.21,51079-768,Shelby Morratt,Female,933482.06,1
294,295,Aivee,4041,13 Hauk Way,Pontiac,Grand Am,Fuscia,1988,511763.96,60429-369,Chandler Hawkett,Male,981485.26,2
295,296,Twitterlist,146,566 Westerfield Point,Lincoln,MKZ,Violet,2007,732421.30,30142-406,Matthieu Bonifant,Male,941955.73,1
298,299,JumpXS,8765,627 Havey Drive,Volkswagen,Passat,Mauv,2012,714281.60,55154-1855,Elladine Rivaland,Female,908766.53,2

In [84]:
df1 = df[df['CarModel']=="M-Class"]
df1

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
10,11,Layo,9212,7 Esch Trail,Mercedes-Benz,M-Class,Mauv,2002,722114.57,0955-1015,Duff Dodgshun,Male,932957.69,1

In [87]:
df.SupplierName          #like this

0       Bubbletube
1          Tagopia
2          Zoomdog
3             Oozz
4             Kare
          ...
294          Aivee
295    Twitterlist
296           Ntag
297         Demizz
298         JumpXS
Name: SupplierName, Length: 299, dtype: object

In [89]:
df['SupplierName']         #like this

0       Bubbletube
1          Tagopia
2          Zoomdog
3             Oozz
4             Kare
          ...
294          Aivee
295    Twitterlist
296           Ntag
297         Demizz
298         JumpXS
Name: SupplierName, Length: 299, dtype: object

In [86]:
df[['CarMaker','CarModelYear']]

          CarMaker  CarModelYear
0            Dodge          2007
1           Toyota          2010
2              GMC          2011
3       Volkswagen          1990
4          Mercury          2009
..             ...           ...
294        Pontiac          1988
295        Lincoln          2007
296          Buick          2005
297  Mercedes-Benz          2007
298     Volkswagen          2012

[299 rows x 2 columns]

In [90]:
df[0:20]

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
0,1,Bubbletube,8893,542 Dayton Center,Dodge,Ram 2500,Goldenrod,2007,521963.45,60760-224,Louie Hinsche,Male,744796.41,1
1,2,Tagopia,9444,0674 Springview Circle,Toyota,Tundra,Crimson,2010,672222.04,67457-594,Alexandros Manuel,Male,794773.17,1
2,3,Zoomdog,253,70 Autumn Leaf Center,GMC,Savana 1500,Crimson,2011,504465.72,58411-135,Alvie Weighell,Male,968244.90,1
3,4,Oozz,1283,649 Corben Lane,Volkswagen,Cabriolet,Fuscia,1990,646077.11,0591-5307,Flint Gunston,Male,942213.82,2
4,5,Kare,8905,94 Namekagon Point,Mercury,Mariner,Teal,2009,699890.24,51655-189,Alyssa Filpi,Female,879519.57,1
5,6,Rhynyx,8877,46347 Dunning Drive,Toyota,Land Cruiser,Crimson,2005,694373.94,65811-0001,Wiatt Piche,Male,947785.40,2
6,7,Roombo,101,85 Coleman Parkway,Subaru,Impreza,Indigo,1999,546977.55,31722-328,Findlay Alberti,Male,883836.81,2
7,8,Wordify,8854,30230 Westerfield Pass,BMW,X6,Purple,2013,528353.80,54162-018,Ottilie Wittman,Female,779626.29,1
8,9,Skyvu,9043,4 Coleman Street,Mitsubishi,Galant,Orange,2011,706964.35,44911-0060,Kirsten Calvey,Female,818364.32,2
9,10,Feedfire,492,100 Anhalt Place,Subaru,Justy,Crimson,1988,798573.59,54868-5732,Archer Landsborough,Male,902866.47,1
10,11,Layo,9212,7 Esch Trail,Mercedes-Benz,M-Class,Mauv,2002,722114.57,0955-1015,Duff Dodgshun,Male,932957.69,1
11,12,Oyoyo,7891,6 Meadow Vale Center,Ford,Taurus X,Crimson,2008,761182.85,54838-101,Barry Delves,Female,743643.26,2
12,13,Quatz,3334,0972 Pepper Wood Lane,Mercedes-Benz,CL-Class,Red,2011,568015.89,49825-119,Libbey Divell,Female,856186.55,2
13,14,Gabvine,8898,55262 Emmet Place,Dodge,Avenger,Turquoise,2008,646591.02,54799-504,Demetria Hazelgrove,Female,703359.96,1
14,15,Jaxspan,4531,330 Pennsylvania Plaza,Nissan,Pathfinder,Khaki,2002,670304.84,43742-0059,Creigh Wreakes,Male,832581.18,2
15,16,Mybuzz,3327,428 Meadow Ridge Alley,BMW,M3,Turquoise,2009,728986.85,68788-9728,Erv Manville,Male,948098.46,2
16,17,Gabcube,7975,26 Stuart Court,Mercedes-Benz,R-Class,Puce,2009,665854.24,0228-2672,Mychal Zanetti,Male,856069.09,2
17,18,Lazz,7029,73 Beilfuss Road,Honda,FCX Clarity,Yellow,2012,707705.42,21695-215,Jermain Proudman,Male,749727.44,1
18,19,Buzzdog,2373,9 Lukken Way,Toyota,Corolla,Aquamarine,2004,563380.63,37000-352,Liuka Dundin,Female,758563.82,2
19,20,Yodel,5839,411 Coleman Circle,Ford,Tempo,Turquoise,1988,686028.43,49288-0606,Timmy Duck,Female,927054.81,2

In [93]:
df.loc[0:10,['SupplierName','CarMaker','CarModelYear']]       #loc - 0 to 10 (all from 0 to 10 ,no omittions)

   SupplierName       CarMaker  CarModelYear
0    Bubbletube          Dodge          2007
1       Tagopia         Toyota          2010
2       Zoomdog            GMC          2011
3          Oozz     Volkswagen          1990
4          Kare        Mercury          2009
5        Rhynyx         Toyota          2005
6        Roombo         Subaru          1999
7       Wordify            BMW          2013
8         Skyvu     Mitsubishi          2011
9      Feedfire         Subaru          1988
10         Layo  Mercedes-Benz          2002

In [96]:
df.iloc[0:10,[1,3,6,8]]                 #iloc - 0 to 10 (10 omitted)

  SupplierName         SupplierAddress   CarColor   CarPrice
0   Bubbletube       542 Dayton Center  Goldenrod  521963.45
1      Tagopia  0674 Springview Circle    Crimson  672222.04
2      Zoomdog   70 Autumn Leaf Center    Crimson  504465.72
3         Oozz         649 Corben Lane     Fuscia  646077.11
4         Kare      94 Namekagon Point       Teal  699890.24
5       Rhynyx     46347 Dunning Drive    Crimson  694373.94
6       Roombo      85 Coleman Parkway     Indigo  546977.55
7      Wordify  30230 Westerfield Pass     Purple  528353.80
8        Skyvu        4 Coleman Street     Orange  706964.35
9     Feedfire        100 Anhalt Place    Crimson  798573.59

In [100]:
df.iloc[0]             #first row

SupplierID                         1
SupplierName              Bubbletube
ProductID                       8893
SupplierAddress    542 Dayton Center
CarMaker                       Dodge
CarModel                    Ram 2500
CarColor                   Goldenrod
CarModelYear                    2007
CarPrice                   521963.45
CustomerID                 60760-224
CustomerName           Louie Hinsche
Gender                          Male
Sales                      744796.41
Quantity                           1
Name: 0, dtype: object

In [101]:
df.iloc[:0,:]         #0 omitted

Empty DataFrame
Columns: [SupplierID, SupplierName, ProductID, SupplierAddress, CarMaker, CarModel, CarColor, CarModelYear, CarPrice, CustomerID, CustomerName, Gender, Sales, Quantity]
Index: []

In [102]:
df.iloc[:1,:]        #0 to 1 (1 omitted)

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
0,1,Bubbletube,8893,542 Dayton Center,Dodge,Ram 2500,Goldenrod,2007,521963.45,60760-224,Louie Hinsche,Male,744796.41,1

In [103]:
df.iloc[5]         #sixth row          #i+1th row

SupplierID                           6
SupplierName                    Rhynyx
ProductID                         8877
SupplierAddress    46347 Dunning Drive
CarMaker                        Toyota
CarModel                  Land Cruiser
CarColor                       Crimson
CarModelYear                      2005
CarPrice                     694373.94
CustomerID                  65811-0001
CustomerName               Wiatt Piche
Gender                            Male
Sales                         947785.4
Quantity                             2
Name: 5, dtype: object

In [104]:
df.iloc[-1]          #last row

SupplierID                       299
SupplierName                  JumpXS
ProductID                       8765
SupplierAddress      627 Havey Drive
CarMaker                  Volkswagen
CarModel                      Passat
CarColor                        Mauv
CarModelYear                    2012
CarPrice                    714281.6
CustomerID                55154-1855
CustomerName       Elladine Rivaland
Gender                        Female
Sales                      908766.53
Quantity                           2
Name: 298, dtype: object

In [105]:
df.iloc[-2]         #second last row

SupplierID                        298
SupplierName                   Demizz
ProductID                        8052
SupplierAddress    0347 Morrow Avenue
CarMaker                Mercedes-Benz
CarModel                      E-Class
CarColor                        Khaki
CarModelYear                     2007
CarPrice                    725040.78
CustomerID                  43269-612
CustomerName           Dorena Coatham
Gender                         Female
Sales                       735854.69
Quantity                            1
Name: 297, dtype: object

In [106]:
df.iloc[:,0]               #first column only

0        1
1        2
2        3
3        4
4        5
      ...
294    295
295    296
296    297
297    298
298    299
Name: SupplierID, Length: 299, dtype: int64

In [109]:
df.iloc[:0,0]

Series([], Name: SupplierID, dtype: int64)

In [110]:
df.iloc[:1,0]

0    1
Name: SupplierID, dtype: int64

In [112]:
df.iloc[:2,2:7]

   ProductID         SupplierAddress CarMaker  CarModel   CarColor
0       8893       542 Dayton Center    Dodge  Ram 2500  Goldenrod
1       9444  0674 Springview Circle   Toyota    Tundra    Crimson

In [113]:
df.iloc[-1:0,5]

Series([], Name: CarModel, dtype: object)

In [4]:
df.iloc[-1:0,0:1]

Empty DataFrame
Columns: [SupplierID]
Index: []

In [5]:
df.iloc[-1:0,0:2]

Empty DataFrame
Columns: [SupplierID, SupplierName]
Index: []

In [117]:
df.iloc[:,-1]           #all the rows last column

0      1
1      1
2      1
3      2
4      1
      ..
294    2
295    1
296    1
297    1
298    2
Name: Quantity, Length: 299, dtype: int64

In [118]:
df.iloc[:,-1:-2]

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[299 rows x 0 columns]

In [119]:
df.iloc[:,-2:-1]

         Sales
0    744796.41
1    794773.17
2    968244.90
3    942213.82
4    879519.57
..         ...
294  981485.26
295  941955.73
296  730755.76
297  735854.69
298  908766.53

[299 rows x 1 columns]

In [121]:
df.iloc[0:1,-1:0]

Empty DataFrame
Columns: []
Index: [0]

In [122]:
df.iloc[0:1,0:-1]

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales
0,1,Bubbletube,8893,542 Dayton Center,Dodge,Ram 2500,Goldenrod,2007,521963.45,60760-224,Louie Hinsche,Male,744796.41

In [125]:
df.iloc[1:4,2:5]

   ProductID         SupplierAddress    CarMaker
1       9444  0674 Springview Circle      Toyota
2        253   70 Autumn Leaf Center         GMC
3       1283         649 Corben Lane  Volkswagen

In [126]:
df.iloc[0:4,2:5]

   ProductID         SupplierAddress    CarMaker
0       8893       542 Dayton Center       Dodge
1       9444  0674 Springview Circle      Toyota
2        253   70 Autumn Leaf Center         GMC
3       1283         649 Corben Lane  Volkswagen

In [127]:
df.iloc[[1,2],[1,2]]

  SupplierName  ProductID
1      Tagopia       9444
2      Zoomdog        253

In [128]:
df.iloc[[2,5],0:5]

   SupplierID SupplierName  ProductID        SupplierAddress CarMaker
2           3      Zoomdog        253  70 Autumn Leaf Center      GMC
5           6       Rhynyx       8877    46347 Dunning Drive   Toyota

In [129]:
df.iloc[0:5,[2,3]]

   ProductID         SupplierAddress
0       8893       542 Dayton Center
1       9444  0674 Springview Circle
2        253   70 Autumn Leaf Center
3       1283         649 Corben Lane
4       8905      94 Namekagon Point

In [130]:
df.loc[[2,3],['CarModel']]

      CarModel
2  Savana 1500
3    Cabriolet

In [134]:
df.loc[0:5,['Sales']]

       Sales
0  744796.41
1  794773.17
2  968244.90
3  942213.82
4  879519.57
5  947785.40

In [135]:
#sorting 

df1 = df.sort_values(by = 'Sales')
df1.head()

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
177,178,Kanoodle,5599,666 Riverside Crossing,Oldsmobile,Regency,Puce,1997,512516.00,49349-272,Willard France,Male,700321.49,2
104,105,Chatterbridge,4571,79 Tennyson Road,Cadillac,Escalade,Red,2007,514525.98,11584-1060,Gerek Timmins,Male,700375.26,2
227,228,Yodoo,4349,6684 Pierstorff Trail,Geo,Tracker,Aquamarine,1992,793703.68,0591-3602,Vanny Culham,Female,701839.30,1
292,293,Jaxbean,5719,34 Fieldstone Way,GMC,3500 Club Coupe,Puce,1996,747040.10,48951-6040,Cristabel Killshaw,Female,701880.61,2
13,14,Gabvine,8898,55262 Emmet Place,Dodge,Avenger,Turquoise,2008,646591.02,54799-504,Demetria Hazelgrove,Female,703359.96,1

In [137]:
df1 = df.sort_values(['ProductID','CarColor'],ascending =[True,False])
df1.head()

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
276,277,Avamm,24,53549 Reindahl Terrace,Honda,Civic,Crimson,2003,641468.71,69152-0078,Peria Bovis,Female,821835.59,1
234,235,Abatz,53,344 Marquette Park,Mazda,MPV,Puce,1992,750536.81,49215-0001,Flory Martugin,Female,833339.07,2
247,248,Eamia,54,76827 Old Gate Avenue,Infiniti,G37,Yellow,2011,753206.05,43269-780,Fidela Gepson,Female,915779.62,2
222,223,Skipfire,101,5 Hoffman Place,Toyota,Highlander,Yellow,2009,765726.97,49999-598,Richart Lebbon,Male,712970.25,1
6,7,Roombo,101,85 Coleman Parkway,Subaru,Impreza,Indigo,1999,546977.55,31722-328,Findlay Alberti,Male,883836.81,2

In [140]:
df1 = df.sort_values(['CarModel'])
df1

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
203,204,Photobug,3029,00932 Upham Place,Saab,09-May,Yellow,2006,694876.95,59062-1227,Karalee Lackmann,Female,738823.53,1
39,40,Quinu,9901,25003 Arizona Court,Audi,100,Goldenrod,1992,518104.02,49938-102,Lishe Healeas,Female,891387.37,2
269,270,Mynte,9045,403 Bayside Parkway,GMC,1500,Yellow,1997,561693.79,59011-444,Jordan Heatlie,Male,924763.35,2
207,208,Photobean,2491,51 Twin Pines Circle,GMC,1500,Yellow,1996,621950.59,0121-4675,Jourdain Kingzeth,Male,714287.99,2
169,170,Abata,522,026 Manley Lane,GMC,2500 Club Coupe,Puce,1993,715190.72,0699-7051,Francois Tankard,Male,929803.73,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
72,73,DabZ,2631,52 Lakewood Gardens Plaza,Cadillac,XLR,Red,2008,545080.04,24987-562,Morie Mowsdell,Male,752558.40,1
248,249,Avaveo,1739,4 Monterey Terrace,Subaru,XT,Teal,1985,686586.66,16590-244,Enriqueta Blissett,Female,847308.19,2
133,134,Rooxo,6552,6414 Moulton Point,GMC,Yukon XL 1500,Crimson,2010,698915.25,51141-5000,Sabine Maude,Female,759267.76,1
284,285,Lazz,1033,4 Graedel Street,GMC,Yukon XL 1500,Pink,2002,643916.65,54340-779,Madelon Ambroz,Female,951156.30,2
161,162,Kayveo,5751,89 Brentwood Terrace,GMC,Yukon XL 2500,Crimson,2003,589447.20,59262-259,Josey Pargetter,Female,754756.67,1

In [142]:
df1 = df.sort_values(['ProductID','CarColor'],ascending = [True,True])
df1

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
276,277,Avamm,24,53549 Reindahl Terrace,Honda,Civic,Crimson,2003,641468.71,69152-0078,Peria Bovis,Female,821835.59,1
234,235,Abatz,53,344 Marquette Park,Mazda,MPV,Puce,1992,750536.81,49215-0001,Flory Martugin,Female,833339.07,2
247,248,Eamia,54,76827 Old Gate Avenue,Infiniti,G37,Yellow,2011,753206.05,43269-780,Fidela Gepson,Female,915779.62,2
6,7,Roombo,101,85 Coleman Parkway,Subaru,Impreza,Indigo,1999,546977.55,31722-328,Findlay Alberti,Male,883836.81,2
222,223,Skipfire,101,5 Hoffman Place,Toyota,Highlander,Yellow,2009,765726.97,49999-598,Richart Lebbon,Male,712970.25,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41,42,Skyndu,9905,39 Brickson Park Parkway,Chevrolet,Suburban 2500,Aquamarine,2009,794485.02,11697-373,Friedrich Roswarne,Male,722987.23,1
170,171,Feedbug,9927,6616 Warbler Hill,Isuzu,Hombre Space,Maroon,2000,688506.62,68788-9141,Aile Rodell,Female,896394.92,2
79,80,Eadel,9933,24 Loeprich Terrace,Buick,Regal,Purple,1989,667039.78,45963-538,Ozzie Oade,Male,830149.53,2
139,140,Ainyx,9955,5 Onsgard Way,Mitsubishi,Diamante,Turquoise,2000,797965.14,47682-903,Lane Boreham,Male,767372.51,2
187,188,Jabbercube,9959,0 Harbort Lane,Cadillac,Seville,Fuscia,2001,774642.61,55154-5676,Derick Blaasch,Male,946737.19,1

In [144]:
df1 = df.sort_values(['CarColor','ProductID'],ascending = [True,True])       # the column first will be arranged in ascending order 
df1

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
162,163,Layo,600,255 Hoepker Center,Mitsubishi,Endeavor,Aquamarine,2006,753865.45,11564-003,Kendra Pearmine,Female,777555.76,1
18,19,Buzzdog,2373,9 Lukken Way,Toyota,Corolla,Aquamarine,2004,563380.63,37000-352,Liuka Dundin,Female,758563.82,2
184,185,Babbleblab,3504,9 Alpine Terrace,Mercedes-Benz,E-Class,Aquamarine,2005,763055.59,36800-010,Lula MacIllrick,Female,931107.08,1
43,44,Avavee,3792,0473 Sunbrook Point,Honda,Accord,Aquamarine,2007,649862.04,62499-395,Barrett Eminson,Male,902974.39,1
256,257,Dynabox,3830,7114 Pierstorff Way,Pontiac,Grand Prix,Aquamarine,1992,760929.24,11822-0900,Will Lumley,Male,948947.68,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
219,220,Skiptube,8554,30 West Court,Toyota,Sequoia,Yellow,2006,774830.01,44717-536,Merrill Ryves,Male,818806.17,2
153,154,Fadeo,8739,745 Veith Circle,Buick,Regal,Yellow,2002,524700.33,43353-754,Geoffrey Ackermann,Male,961575.66,1
67,68,Gigashots,8854,0759 Swallow Drive,Nissan,Sentra,Yellow,2006,567121.20,0517-0033,Ethelred Thorington,Male,849446.97,1
266,267,Linkbridge,9001,440 Arizona Center,Toyota,Tundra,Yellow,2008,609769.87,49349-866,Van Ayree,Male,885462.32,1
269,270,Mynte,9045,403 Bayside Parkway,GMC,1500,Yellow,1997,561693.79,59011-444,Jordan Heatlie,Male,924763.35,2

In [145]:
df1 = df.sort_values(['CarColor','ProductID'],ascending = [True,False])       # the column first will be arranged in ascending order 
df1

,SupplierID,SupplierName,ProductID,SupplierAddress,CarMaker,CarModel,CarColor,CarModelYear,CarPrice,CustomerID,CustomerName,Gender,Sales,Quantity
41,42,Skyndu,9905,39 Brickson Park Parkway,Chevrolet,Suburban 2500,Aquamarine,2009,794485.02,11697-373,Friedrich Roswarne,Male,722987.23,1
21,22,Skidoo,8464,196 Darwin Park,Chevrolet,Monte Carlo,Aquamarine,1996,569743.98,23155-141,Aimee O'Canavan,Female,718907.78,1
282,283,Gigabox,8460,74909 Ludington Trail,Mitsubishi,L300,Aquamarine,1990,691843.34,68258-3024,Stearne Fullerton,Male,978185.90,2
216,217,Feedfire,8233,18059 Toban Court,Buick,Century,Aquamarine,1989,591275.55,60681-2105,Meir Poff,Male,705535.68,2
77,78,Fadeo,7833,479 Shoshone Center,Mitsubishi,Precis,Aquamarine,1994,766396.94,0944-4351,Joan Beddon,Female,899946.21,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
218,219,Dabfeed,672,6692 Village Lane,BMW,M Roadster,Yellow,2008,622688.00,65862-536,Keen Galego,Male,830384.88,1
262,263,Blogtag,529,8 Dapin Center,Cadillac,Eldorado,Yellow,1999,662587.93,51060-045,Dione McPartling,Female,948713.24,1
175,176,Twitterworks,292,8 Esker Pass,Mercedes-Benz,SL-Class,Yellow,2011,749804.88,53603-1006,Gonzales Shoard,Male,914755.73,1
222,223,Skipfire,101,5 Hoffman Place,Toyota,Highlander,Yellow,2009,765726.97,49999-598,Richart Lebbon,Male,712970.25,1
247,248,Eamia,54,76827 Old Gate Avenue,Infiniti,G37,Yellow,2011,753206.05,43269-780,Fidela Gepson,Female,915779.62,2

In [146]:
df[df.isnull().any(axis=1)].head()

Empty DataFrame
Columns: [SupplierID, SupplierName, ProductID, SupplierAddress, CarMaker, CarModel, CarColor, CarModelYear, CarPrice, CustomerID, CustomerName, Gender, Sales, Quantity]
Index: []

In [147]:
df[df.isnull().any(axis=0)].head()

<ipython-input-147-31d0acfeab6a>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df.isnull().any(axis=0)].head()

<class 'pandas.errors.IndexingError'>: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

In [153]:
# Aggregate Functions

df[['Sales','Quantity']].agg(['min','max','mean'])

              Sales  Quantity
min   700321.490000  1.000000
max   998843.290000  2.000000
mean  853155.083712  1.545151

In [155]:
df[['Sales','Quantity']].mode()

         Sales  Quantity
0    700321.49       2.0
1    700375.26       NaN
2    701839.30       NaN
3    701880.61       NaN
4    703359.96       NaN
..         ...       ...
294  992886.70       NaN
295  993717.13       NaN
296  993775.95       NaN
297  997480.97       NaN
298  998843.29       NaN

[299 rows x 2 columns]

In [156]:
df['Sales'].skew()

-0.1531041913282873

In [158]:
df['Sales'].kurt()

-1.2716844486432157